
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Policies · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="peers.html" />
    
    
    <link rel="prev" href="membership-service-provider-msp.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">介绍</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第一章关键概念</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="hyperledger-fabric-model.html">
            
                <a href="hyperledger-fabric-model.html">
            
                    
                    Hyperledger Fabric Model
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="blockchain-network.html">
            
                <a href="blockchain-network.html">
            
                    
                    Blockchain network
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="identity.html">
            
                <a href="identity.html">
            
                    
                    Identity
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="membership-service-provider-msp.html">
            
                <a href="membership-service-provider-msp.html">
            
                    
                    Membership Service Provider (MSP)
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.6" data-path="policies.html">
            
                <a href="policies.html">
            
                    
                    Policies
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="peers.html">
            
                <a href="peers.html">
            
                    
                    Peers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="ledger.html">
            
                <a href="ledger.html">
            
                    
                    Ledger
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="the-ordering-service.html">
            
                <a href="the-ordering-service.html">
            
                    
                    The Ordering Service
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.10" >
            
                <span>
            
                    
                    Smart Contracts and Chaincode
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="2.11" data-path="fabric-chaincode-lifecycle.html">
            
                <a href="fabric-chaincode-lifecycle.html">
            
                    
                    Fabric chaincode lifecycle
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二章 构建第一个Fabric程序</li>
        
        
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Policies</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B56;&#x7565;">&#x7B56;&#x7565;</h1>
<p>&#x200B;    <strong>&#x53D7;&#x4F17;</strong>&#xFF1A; &#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x5E94;&#x7528;&#x548C;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x7BA1;&#x7406;&#x5458;</p>
<p>&#x200B;    &#x672C;&#x4E3B;&#x9898;&#x5C06;&#x5305;&#x542B;&#xFF1A;</p>
<ul>
<li>&#x4EC0;&#x4E48;&#x662F;&#x7B56;&#x7565;</li>
<li>&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7B56;&#x7565;</li>
<li>&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7B56;&#x7565;</li>
<li>&#x5728;Fabric&#x4E2D;&#x600E;&#x4E48;&#x5199;&#x7B56;&#x7565;</li>
<li>Fabric&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;</li>
<li>&#x91CD;&#x8F7D;&#x901A;&#x9053;&#x7B56;&#x7565;</li>
</ul>
<p>&#x200B;    &#x6CE8;&#x610F;&#xFF1A;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x4E2D;&#x5C06;&#x63CF;&#x8FF0;&#x4E00;&#x79CD;&#x4E0D;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x901A;&#x9053;&#xFF08;&#x7531;&#x6392;&#x5E8F;&#x670D;&#x52A1;&#x542F;&#x52A8;&#x5E76;&#x4E14;&#x7531;&#x6392;&#x5E8F;&#x670D;&#x52A1;&#x72EC;&#x5360;&#x63A7;&#x5236;&#x7684;&#x901A;&#x9053;&#xFF09;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x81EA;&#x4ECE;2.3&#x7248;&#x672C;&#x53D1;&#x5E03;&#x4EE5;&#x6765;&#xFF0C;&#x4E0E;&#x6CA1;&#x6709;&#x521B;&#x5EFA;&#x7CFB;&#x7EDF;&#x901A;&#x9053;&#x7684;&#x901A;&#x9053;&#x76F8;&#x6BD4;&#xFF0C;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x901A;&#x9053;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x9057;&#x7559;&#x7684;&#x8FDB;&#x7A0B;&#x3002;2.2&#x7248;&#x672C;&#x4E2D;&#x7684;&#x8FD9;&#x4E00;&#x8282;&#x4ECB;&#x7ECD;&#x7684;&#x662F;&#x5305;&#x542B;&#x4E86;&#x7CFB;&#x7EDF;&#x901A;&#x9053;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x7B56;&#x7565;">&#x4EC0;&#x4E48;&#x662F;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x7B56;&#x7565;&#x662F;&#x4E00;&#x7EC4;&#x89C4;&#x5219;&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x5982;&#x4F55;&#x505A;&#x51FA;&#x51B3;&#x7B56;&#x548C;&#x5B9E;&#x73B0;&#x7279;&#x5B9A;&#x7ED3;&#x679C;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x7B56;&#x7565;&#x4E00;&#x822C;&#x63CF;&#x8FF0;&#x4E86;<strong>&#x8C01;</strong>&#xFF08;who&#xFF09;&#x548C;<strong>&#x4EC0;&#x4E48;</strong>(what)&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;<strong>&#x8D44;&#x4EA7;</strong>&#x7684;&#x8BBF;&#x95EE;&#x6216;&#x8005;&#x6743;&#x9650;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x7B56;&#x7565;&#x4E5F;&#x5728;&#x4FDD;&#x62A4;&#x6211;&#x4EEC;&#x7684;&#x8D44;&#x4EA7;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x6C7D;&#x8F66;&#x79DF;&#x91D1;&#x3001;&#x5065;&#x5EB7;&#x3001;&#x6211;&#x4EEC;&#x7684;&#x623F;&#x5B50;&#x7B49;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;&#x4FDD;&#x9669;&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x4E86;&#x4FDD;&#x9669;&#x8D54;&#x4ED8;&#x7684;&#x6761;&#x4EF6;&#x3001;&#x6761;&#x6B3E;&#x3001;&#x9650;&#x5236;&#x548C;&#x5230;&#x671F;&#x65F6;&#x95F4;&#x3002;&#x8BE5;&#x7B56;&#x7565;&#x7ECF;&#x8FC7;&#x4E86;&#x7B56;&#x7565;&#x6301;&#x6709;&#x8005;&#x548C;&#x4FDD;&#x9669;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x81F4;&#x540C;&#x610F;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x5404;&#x65B9;&#x7684;&#x6743;&#x5229;&#x548C;&#x8D23;&#x4EFB;&#x3002;&#x4FDD;&#x9669;&#x7B56;&#x7565;&#x7528;&#x4E8E;&#x98CE;&#x9669;&#x7BA1;&#x7406;&#xFF0C;&#x5728; Hyperledger Fabric &#x4E2D;&#xFF0C;&#x7B56;&#x7565;&#x662F;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x3002;Fabric&#x7B56;&#x7565;&#x8868;&#x793A;&#x6210;&#x5458;&#x5982;&#x4F55;&#x5C31;&#x63A5;&#x53D7;&#x6216;&#x62D2;&#x7EDD;&#x5BF9;&#x7F51;&#x7EDC;&#x3001;&#x901A;&#x9053;&#x6216;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x7684;&#x66F4;&#x6539;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x7B56;&#x7565;&#x5728;&#x7F51;&#x7EDC;&#x6700;&#x521D;&#x914D;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#x7531;&#x8054;&#x76DF;&#x6210;&#x5458;&#x4E00;&#x81F4;&#x540C;&#x610F;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x6F14;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4ED6;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4ECE;&#x901A;&#x9053;&#x4E2D;&#x6DFB;&#x52A0;&#x6216;&#x8005;&#x5220;&#x9664;&#x6210;&#x5458;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6539;&#x53D8;&#x533A;&#x5757;&#x683C;&#x5F0F;&#x6216;&#x8005;&#x6307;&#x5B9A;&#x9700;&#x8981;&#x7ED9;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x80CC;&#x4E66;&#x7684;&#x7EC4;&#x7EC7;&#x6570;&#x91CF;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x8C01;&#x53EF;&#x4EE5;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#x884C;&#x4E3A;&#x90FD;&#x5728;&#x7B56;&#x7565;&#x4E2D;&#x63CF;&#x8FF0;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x5728; Fabric &#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x8981;&#x53D7;&#x5230;&#x7B56;&#x7565;&#x7684;&#x63A7;&#x5236;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7B56;&#x7565;">&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x7B56;&#x7565;&#x662F;&#x4F7F; Hyperledger Fabric &#x4E0D;&#x540C;&#x4E8E;&#x5176;&#x4ED6;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#xFF08;&#x6BD4;&#x5982; Ethereum &#x6216;&#x8005; Bitcoin&#xFF09;&#x7684;&#x5185;&#x5BB9;&#x4E4B;&#x4E00;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x8282;&#x70B9;&#x751F;&#x6210;&#x548C;&#x9A8C;&#x8BC1;&#xFF0C;&#x7BA1;&#x7406;&#x7F51;&#x7EDC;&#x7684;&#x7B56;&#x7565;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x70B9;&#x90FD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E0E;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x7684;&#x76F8;&#x540C;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x3002;&#x56E0;&#x4E3A; Fabric &#x662F;&#x8BB8;&#x53EF;&#x94FE;&#xFF08;&#x5E95;&#x5C42;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4F1A;&#x5BF9;&#x5B83;&#x7684;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x542F;&#x52A8;&#x524D;&#x51B3;&#x5B9A;&#x7F51;&#x7EDC;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x6539;&#x53D8;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7F51;&#x7EDC;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x200B;    &#x7B56;&#x7565;&#x51B3;&#x5B9A;&#x4E86;&#x90A3;&#x4E9B;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6216;&#x8005;&#x66F4;&#x65B0; Fabric &#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x51B3;&#x7B56;&#x7684;&#x673A;&#x5236;&#x3002;&#x7B56;&#x7565;&#x5305;&#x542B;&#x5BF9;&#x7ED9;&#x5B9A;&#x8D44;&#x6E90;(&#x5982;&#x7528;&#x6237;&#x6216;&#x7CFB;&#x7EDF;&#x94FE;&#x4EE3;&#x7801;)&#x5177;&#x6709;&#x8BBF;&#x95EE;&#x6743;&#x7684;&#x7EC4;&#x7EC7;&#x7684;&#x5217;&#x8868;&#x3002;&#x5B83;&#x4EEC;&#x8FD8;&#x6307;&#x5B9A;&#x4E86;&#x9700;&#x8981;&#x591A;&#x5C11;&#x7EC4;&#x7EC7;&#x5C31;&#x8D44;&#x6E90;&#xFF08;&#x6BD4;&#x5982;&#x901A;&#x9053;&#x6216;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#xFF09;&#x66F4;&#x65B0;&#x7684;&#x63D0;&#x8BAE;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x4E00;&#x65E6;&#x7B56;&#x7565;&#x88AB;&#x5199;&#x5165;&#xFF0C;&#x7B56;&#x7565;&#x5C31;&#x4F1A;&#x8BC4;&#x4F30;&#x4E0E;&#x4EA4;&#x6613;&#x548C;&#x63D0;&#x6848;&#x76F8;&#x5173;&#x7684;&#x7B7E;&#x540D;&#x96C6;&#x5408;&#xFF0C;&#x5E76;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x7F51;&#x7EDC;&#x7684;&#x7BA1;&#x7406;&#x89C4;&#x5219;&#x3002;</p>
<h2 id="fabric&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#x7684;">Fabric&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#x7684;</h2>
<p>&#x200B;    &#x7B56;&#x7565;&#x662F;&#x5728;&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x7684;&#x7279;&#x5B9A;&#x64CD;&#x4F5C;&#x7684;&#x76F8;&#x5173;&#x7BA1;&#x7406;&#x57DF;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#x6DFB;&#x52A0;&#x5230;&#x901A;&#x9053;&#x7684;&#x7B56;&#x7565;&#x662F;&#x5728;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#xFF08;Application group,&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EC4;&#xFF09;&#x7684;&#x7BA1;&#x7406;&#x57DF;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5C06;&#x6392;&#x5E8F;&#x8282;&#x70B9;&#x6DFB;&#x52A0;&#x5230;&#x901A;&#x9053;&#x7684;&#x5171;&#x8BC6;&#x8282;&#x70B9;&#x96C6;&#x5408;&#x662F;&#x7531;&#x6392;&#x5E8F;&#x8282;&#x70B9;&#x7EC4;&#xFF08;Orderer group&#xFF09;&#x7684;&#x7B56;&#x7565;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x5BF9;&#x6392;&#x5E8F;&#x8282;&#x70B9;&#x548C;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x7684;&#x7EC4;&#x7EC7;&#x57DF;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x5305;&#x542B;&#x5728;&#x901A;&#x9053;&#x7EC4;&#xFF08;Channel group&#xFF09;&#x4E2D;&#x3002;</p>
<p>&#x200B;    &#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5728;&#x5176;&#x6240;&#x5C5E;&#x7EC4;&#x4E2D;&#x90FD;&#x662F;&#x9ED8;&#x8BA4;&#x4E3A;&#x201C;&#x591A;&#x6570;&#x4EBA;&#x7BA1;&#x7406;&#x201D;&#xFF08;&#x4F8B;&#x5982;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x4E8E;&#x901A;&#x9053;&#x7B56;&#x7565;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x5927;&#x591A;&#x6570;&#x7684;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#x548C;&#x6392;&#x5E8F;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#xFF0C;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x89C4;&#x5219;&#x4E2D;&#x6307;&#x5B9A;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x3002;</p>
<h2 id="&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x5217;&#x8868;&#xFF08;access-control-lists&#xFF0C;acls&#xFF09;">&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x5217;&#x8868;&#xFF08;Access control lists&#xFF0C;ACLs&#xFF09;</h2>
<p>&#x200B;    &#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x80FD;&#x5BF9; Fabric &#x4E2D; ACL &#x7684;&#x4F7F;&#x7528;&#x66F4;&#x611F;&#x5174;&#x8DA3;&#xFF0C;ACL &#x901A;&#x8FC7;&#x5C06;&#x8D44;&#x6E90;&#x548C;&#x5DF2;&#x6709;&#x7B56;&#x7565;&#x76F8;&#x5173;&#x8054;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x914D;&#x7F6E;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;&#x201C;&#x8D44;&#x6E90;&#x201D;&#x53EF;&#x4EE5;&#x662F;&#x7CFB;&#x7EDF;&#x94FE;&#x7801;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;qscc&#x201D;&#x4E2D;&#x7684;&#x201C;GetBlockByNumber&#x201D;&#xFF09;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8C01;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x533A;&#x5757;&#x4E8B;&#x4EF6;&#xFF0C;Block events&#xFF09;&#x3002;ACL&#x5F15;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5E76;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x4EE5;&#x63A7;&#x5236;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x3002;Fabric ACL &#x7684;&#x9ED8;&#x8BA4;&#x96C6;&#x5408;&#x5728; configtx.yaml&#x6587;&#x4EF6;&#x7684; Application: &amp;ApplicationDefaults&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4E5F;&#x5E94;&#x8BE5;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x88AB;&#x91CD;&#x5199;&#x3002;configtx.yaml&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x8D44;&#x6E90;&#x5217;&#x8868;&#x662F; Fabric &#x5F53;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x5185;&#x90E8;&#x8D44;&#x6E90;&#x7684;&#x5B8C;&#x6574;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x8BE5;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;ACL &#x4EE5;&#x5982;&#x4E0B;&#x683C;&#x5F0F;&#x8868;&#x793A;&#xFF1A;</p>
<pre><code># ACL policy for chaincode to chaincode invocation
peer/ChaincodeToChaincode: /Channel/Application/Writers
</code></pre><p>&#x200B;    &#x5176;&#x4E2D;&#xFF0C;peer/ChaincodeToChaincode&#x8868;&#x793A;&#x88AB;&#x4FDD;&#x62A4;&#x7684;&#x8D44;&#x6E90;&#xFF0C;/Channel/Application/ writer&#x6307;&#x7684;&#x662F;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x6837;&#x76F8;&#x5173;&#x8054;&#x7684;&#x4E8B;&#x52A1;&#x624D;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5173;&#x4E8E; ACL &#x66F4;&#x6DF1;&#x5165;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x64CD;&#x4F5C;&#x6307;&#x5357;&#x4E2D;&#x7684; <a href="https://hyperledger-fabric.readthedocs.io/zh_CN/latest/access_control.html" target="_blank">ACL</a> &#x4E3B;&#x9898;&#x3002;</p>
<h2 id="&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x80CC;&#x4E66;&#x7B56;&#x7565;">&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x80CC;&#x4E66;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x94FE;&#x7801;&#x5305;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#xFF0C;&#x8BE5;&#x7B56;&#x7565;&#x6307;&#x660E;&#x4E86;&#x9700;&#x8981;&#x901A;&#x9053;&#x4E2D;&#x591A;&#x5C11;&#x4E2A;&#x4E0D;&#x540C;&#x7EC4;&#x7EC7;&#x7684;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x6839;&#x636E;&#x6307;&#x5B9A;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x6267;&#x884C;&#x548C;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x624D;&#x80FD;&#x4F7F;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x6709;&#x6548;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x4E86;&#x5FC5;&#x987B;&#x5BF9;&#x63D0;&#x6848;&#x6267;&#x884C;&#x8FDB;&#x884C;&#x201C;&#x80CC;&#x4E66;&#x201D;&#xFF08;&#x6279;&#x51C6;&#xFF09;&#x7684;&#x7EC4;&#x7EC7;&#xFF08;&#x901A;&#x8FC7;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#xFF09;&#x3002;</p>
<h2 id="&#x4FEE;&#x6539;&#x7B56;&#x7565;">&#x4FEE;&#x6539;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5BF9; Fabric &#x7684;&#x7B56;&#x7565;&#x8FD0;&#x4F5C;&#x8D77;&#x7740;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x7684;&#x7B56;&#x7565;&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#x4FEE;&#x6539;&#x7B56;&#x7565;&#x3002;&#x4FEE;&#x6539;&#x7B56;&#x7565;&#x6307;&#x660E;&#x4E86;&#x9700;&#x8981;&#x5BF9;&#x914D;&#x7F6E;&#x66F4;&#x65B0;&#x7B7E;&#x540D;&#x7684;&#x4E00;&#x7EC4;&#x8EAB;&#x4EFD;&#x3002;&#x5B83;&#x662F;&#x5B9A;&#x4E49;&#x5982;&#x4F55;&#x66F4;&#x65B0;&#x7B56;&#x7565;&#x7684;&#x7B56;&#x7565;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x5143;&#x7D20;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x5176;&#x4FEE;&#x6539;&#x7684;&#x7B56;&#x7565;&#x7684;&#x5F15;&#x7528;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x5728;fabric&#x4E2D;&#x5199;&#x7B56;&#x7565;">&#x5982;&#x4F55;&#x5728;Fabric&#x4E2D;&#x5199;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x5982;&#x679C;&#x8981;&#x66F4;&#x6539;Fabric&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#xFF0C;&#x4E0E;&#x8D44;&#x6E90;&#x5173;&#x8054;&#x7684;&#x7B56;&#x7565;&#x63CF;&#x8FF0;&#x4E86;&#x8C01;&#x9700;&#x8981;&#x6279;&#x51C6;&#x5B83;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E2A;&#x4EBA;&#x7684;&#x663E;&#x5F0F;&#x7B7E;&#x540D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7EC4;&#x7684;&#x9690;&#x5F0F;&#x7B7E;&#x540D;&#x3002;&#x5728;&#x4FDD;&#x9669;&#x9886;&#x57DF;&#xFF0C;&#x4E00;&#x4E2A;&#x663E;&#x5F0F;&#x7B7E;&#x540D;&#x53EF;&#x4EE5;&#x662F;&#x4E1A;&#x4E3B;&#x4FDD;&#x9669;&#x4EE3;&#x7406;&#x96C6;&#x56E2;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#x3002;&#x800C;&#x4E00;&#x4E2A;&#x9690;&#x5F0F;&#x7B7E;&#x540D;&#x7C7B;&#x4F3C;&#x4E8E;&#x9700;&#x8981;&#x4E1A;&#x4E3B;&#x4FDD;&#x9669;&#x4EE3;&#x7406;&#x96C6;&#x56E2;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x7BA1;&#x7406;&#x6210;&#x5458;&#x6279;&#x51C6;&#x3002;&#x8FD9;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7EC4;&#x4E2D;&#x7684;&#x6210;&#x5458;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x66F4;&#x65B0;&#x7B56;&#x7565;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x751F;&#x53D8;&#x52A8;&#x3002;&#x5728; Hyperledger Fabric &#x4E2D;&#xFF0C;&#x7B56;&#x7565;&#x4E2D;&#x7684;&#x663E;&#x5F0F;&#x7B7E;&#x540D;&#x4F7F;&#x7528;Signature&#x8BED;&#x6CD5;&#xFF0C;&#x9690;&#x5F0F;&#x7B7E;&#x540D;&#x4F7F;&#x7528;ImplicitMeta&#x8BED;&#x6CD5;&#x3002;</p>
<h2 id="&#x7B7E;&#x540D;&#x7B56;&#x7565;">&#x7B7E;&#x540D;&#x7B56;&#x7565;</h2>
<p>&#x200B;    Signature&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x624D;&#x80FD;&#x6EE1;&#x8DB3;&#x7B56;&#x7565;&#xFF0C;&#x4F8B;&#x5982;OR(&apos;Org1.peer&apos;, &apos;Org2.peer&apos;)&#x3002;&#x7B56;&#x7565;&#x662F;&#x5F88;&#x5F3A;&#x5927;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x590D;&#x6742;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x7EC4;&#x7EC7; A &#x548C; 2 &#x4E2A;&#x5176;&#x4ED6;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x6216;&#x8005; 6 &#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x4E2D;&#x7684; 5 &#x4E2A;&#x201D;&#x3002;&#x8BED;&#x6CD5;&#x652F;&#x6301;AND,OR,NOutOf&#x7684;&#x4EFB;&#x610F;&#x7EC4;&#x5408;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x8868;&#x8FBE;&#x4E3A;AND(&apos;Org1.member&apos;, &apos;Org2.member&apos;)&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x8981;&#x6EE1;&#x8DB3;&#x8BE5;&#x7B56;&#x7565;&#x5C31;&#x540C;&#x65F6;&#x9700;&#x8981; Org1 &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x548C; Org2 &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x7684;&#x7B7E;&#x540D;&#x3002;</p>
<h2 id="&#x9690;&#x5143;&#x7B56;&#x7565;">&#x9690;&#x5143;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x9690;&#x5143;(ImplicitMeta)&#x7B56;&#x7565;&#x4EC5;&#x5728;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x6709;&#x6548;&#xFF0C;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x662F;&#x57FA;&#x4E8E;&#x914D;&#x7F6E;&#x6811;&#x4E2D;&#x7684;&#x7B56;&#x7565;&#x7684;&#x5206;&#x5C42;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x3002;&#x9690;&#x5143;&#x7B56;&#x7565;&#x5C06;&#x7B56;&#x7565;&#x7684;&#x7ED3;&#x679C;&#x805A;&#x5408;&#x5230;&#x914D;&#x7F6E;&#x6811;&#x7684;&#x66F4;&#x6DF1;&#x5904;&#xFF0C;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x6811;&#x6700;&#x7EC8;&#x7531;&#x7B7E;&#x540D;&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x3002;&#x5B83;&#x4EEC;&#x662F;&#x9690;&#x5F0F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x57FA;&#x4E8E;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x4E2D;&#x7684;&#x5F53;&#x524D;&#x7EC4;&#x7EC7;&#x9690;&#x5F0F;&#x6784;&#x9020;&#x7684;;&#x5B83;&#x4EEC;&#x662F;&#x5143;&#x7B56;&#x7565;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x8BC4;&#x4F30;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x7279;&#x5B9A; MSP &#x89C4;&#x8303;&#xFF0C;&#x800C;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x914D;&#x7F6E;&#x6811;&#x4E2D;&#x5B83;&#x4EEC;&#x7684;&#x5176;&#x4ED6;&#x5B50;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x200B;    &#x4E0B;&#x8FB9;&#x7684;&#x56FE;&#x4F8B;&#x8BF4;&#x660E;&#x4E86;&#x5E94;&#x7528;&#x901A;&#x9053;&#x5206;&#x5C42;&#x7684;&#x7B56;&#x7565;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x6F14;&#x793A;&#x4E86;&#x9690;&#x5143;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x7B56;&#x7565;&#xFF08;&#x79F0;&#x4E3A; /Channel/Admins&#xFF09;&#x7684;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#xFF0C;&#x5373;&#x53EA;&#x6709;&#x5F53;&#x5B83;&#x7684;&#x914D;&#x7F6E;&#x5C42;&#x7EA7;&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x5B50;&#x7B56;&#x7565;Admins&#x90FD;&#x6EE1;&#x8DB3;&#x7684;&#x65F6;&#x5019;&#xFF08;&#x590D;&#x9009;&#x6846;&#x6253;&#x52FE;&#x4EE3;&#x8868;&#x5B50;&#x7B56;&#x7565;&#x7684;&#x6761;&#x4EF6;&#x88AB;&#x6EE1;&#x8DB3;&#xFF09;&#xFF0C; /Channel/Admins&#x624D;&#x80FD;&#x88AB;&#x6EE1;&#x8DB3;&#x3002;</p>
<p><img src="https://hyperledger-fabric.readthedocs.io/en/latest/_images/FabricPolicyHierarchy-6.png" alt="policies.policies"></p>
<p>&#x200B;    &#x6B63;&#x5982;&#x4F60;&#x5728;&#x4E0A;&#x56FE;&#x770B;&#x5230;&#x7684;&#x9690;&#x5143;&#x7B56;&#x7565;&#xFF08;Type = 3&#xFF09;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&quot;<any|all|majority> <subpolicyname>&quot;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</subpolicyname></any|all|majority></p>
<pre><code>`MAJORITY sub policy: Admins`
</code></pre><p>&#x200B;    &#x4E0A;&#x9762;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x5B50;&#x7B56;&#x7565;Admins&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x914D;&#x7F6E;&#x6811;&#x4E0B;&#x9762;&#x6240;&#x6709;&#x7684;Admins&#x5B50;&#x7B56;&#x7565;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x5B50;&#x7B56;&#x7565;&#x5E76;&#x4EFB;&#x610F;&#x547D;&#x540D;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5728;&#x4F60;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x4E2D;&#x3002;</p>
<p>&#x200B;    &#x6B63;&#x5982;&#x4E0A;&#x8FB9;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x9690;&#x5143;&#x7B56;&#x7565;&#x6BD4;&#x5982; MAJORITY Admins&#xFF08;&#x591A;&#x6570;&#x4EBA;&#x7BA1;&#x7406;&#xFF09; &#x7684;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x5F53;&#x4F60;&#x5411;&#x901A;&#x9053;&#x6DFB;&#x52A0;&#x65B0;&#x7EC4;&#x7EC7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x7B56;&#x7565;&#x3002;&#x56E0;&#x6B64;&#x9690;&#x5143;&#x7B56;&#x7565;&#x5C31;&#x50CF;&#x8054;&#x76DF;&#x6210;&#x5458;&#x53D8;&#x66F4;&#x4E00;&#x6837;&#x7075;&#x6D3B;&#x3002;&#x8054;&#x76DF;&#x4E2D;&#x6210;&#x5458;&#x7684;&#x65B0;&#x589E;&#x6216;&#x8005;&#x9000;&#x51FA;&#x53EA;&#x8981;&#x8054;&#x76DF;&#x6210;&#x5458;&#x4E00;&#x81F4;&#x540C;&#x610F;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x7B56;&#x7565;&#x3002;&#x91CD;&#x7533;&#x4E00;&#x4E0B;&#xFF0C;&#x9690;&#x5143;&#x7B56;&#x7565;&#x6700;&#x7EC8;&#x5904;&#x7406;&#x7684;&#x662F;&#x5982;&#x56FE;&#x6240;&#x793A;&#x7684;&#x914D;&#x7F6E;&#x6811;&#x4E2D;&#x5B83;&#x4EEC;&#x4E4B;&#x4E0B;&#x7684;&#x7B7E;&#x540D;&#x5B50;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x200B;    &#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7EA7;&#x522B;&#x7684;&#x9690;&#x5F0F;&#x7B56;&#x7565;&#x6765;&#x8FDB;&#x884C;&#x8DE8;&#x7EC4;&#x7EC7;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x901A;&#x9053;&#x4E2D;&#xFF0C;&#x9700;&#x8981; ANY &#xFF08;&#x4EFB;&#x610F;&#xFF09;&#x3001; ALL &#xFF08;&#x5168;&#x90E8;&#xFF09;&#x6216;&#x8005; MAJORITY &#xFF08;&#x5927;&#x591A;&#x6570;&#xFF09;&#x7EC4;&#x7EC7;&#x6765;&#x6EE1;&#x8DB3;&#x3002;&#x8FD9;&#x4E2A;&#x683C;&#x5F0F;&#x6709;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x81EA;&#x7136;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x6709;&#x6548;&#x80CC;&#x4E66;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x5728;&#x7EC4;&#x7EC7;&#x5B9A;&#x4E49;&#x4E2D;&#x5305;&#x542B;NodeOUs&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7C92;&#x5EA6;&#x548C;&#x63A7;&#x5236;&#x3002;&#x7EC4;&#x7EC7;&#x5355;&#x5143;(Organization Units&#xFF0C;OU)&#x5B9A;&#x4E49;&#x5728;Fabric CA&#x5BA2;&#x6237;&#x7AEF;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5728;&#x521B;&#x5EFA;&#x65F6;&#x53EF;&#x4EE5;&#x4E0E;&#x8EAB;&#x4EFD;&#x76F8;&#x5173;&#x8054;&#x3002;&#x5728;Fabric&#x4E2D;&#xFF0C;NodeOUs&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5728;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x5BF9;&#x8EAB;&#x4EFD;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5177;&#x5907;&#x7279;&#x5B9A;&#x7684; NodeOUs &#x7684;&#x7EC4;&#x7EC7;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x5BF9;&#x5B83;&#x7684;&#x7B7E;&#x540D;&#x6765;&#x5B8C;&#x6210;&#x5408;&#x6CD5;&#x7684;&#x80CC;&#x4E66;&#xFF0C;&#x800C;&#x6CA1;&#x6709; NodeOUs&#x7684;&#x7EC4;&#x7EC7;&#x9700;&#x8981;&#x6240;&#x6709;&#x80FD;&#x7B7E;&#x540D;&#x7684;&#x6210;&#x5458;&#x6765;&#x4E3A;&#x5B83;&#x8FDB;&#x884C;&#x80CC;&#x4E66;&#x3002;</p>
<h2 id="&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x7B56;&#x7565;">&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x8981;&#x4ECE;configtx.yaml&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x91CC;&#x8FB9;&#x5B9A;&#x4E49;&#x4E86;&#x901A;&#x9053;&#x7B56;&#x7565;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Fabric&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;configtx.yaml&#x6587;&#x4EF6;&#x6765;&#x67E5;&#x770B;&#x8FD9;&#x4E24;&#x79CD;&#x7B56;&#x7565;&#x8BED;&#x6CD5;&#x7C7B;&#x578B;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5206;&#x6790; <a href="https://github.com/hyperledger/fabric-samples/blob/master/test-network/configtx/configtx.yaml" target="_blank">fabric-samples/test-network</a> &#x793A;&#x4F8B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;configtx.yaml&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x200B;    &#x6587;&#x4EF6;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x5B9A;&#x4E49;&#x4E86;&#x5C06;&#x8981;&#x6210;&#x4E3A;&#x901A;&#x9053;&#x6210;&#x5458;&#x7684;&#x7EC4;&#x7EC7;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#x8BBE;&#x7F6E;&#x4E86;&#x9ED8;&#x8BA4;&#x7B56;&#x7565;&#xFF0C;&#x8BFB;&#x8005;&#xFF0C;&#x5199;&#x8005;&#xFF0C;&#x7BA1;&#x7406;&#x548C;&#x80CC;&#x4E66;&#xFF08;Readers, Writers, Admins, and Endorsement&#xFF09;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x547D;&#x540D;&#x4F60;&#x7684;&#x7B56;&#x7565;&#x3002;&#x6BCF;&#x4E2A;&#x7B56;&#x7565;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF08;Type&#xFF09;&#xFF0C;Type&#x63CF;&#x8FF0;&#x4E86;&#x7B56;&#x7565;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#xFF08;Signature&#x6216;&#x8005;ImplicitMeta&#xFF09;&#x4EE5;&#x53CA;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x200B;    &#x4E0B;&#x9762;&#x7684;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;&#x5C55;&#x793A;&#x4E86;&#x901A;&#x9053;&#x4E2D;&#x7EC4;&#x7EC7;Org1&#x7684;&#x5B9A;&#x4E49;,</p>
<p>&#x200B;    &#x5728;&#x5B83;&#x7684;&#x7B56;&#x7565;&#x4E2D;Type&#x662F;Signature,&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x7684;Rule&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&quot;OR(&apos;Org1MSP.peer&apos;)&quot;&#x3002;&#x6B64;&#x7B56;&#x7565;&#x6307;&#x5B9A;&#x4E86;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x662F;Org1MSP&#x6210;&#x5458;&#x7684;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x3002;&#x8FD9;&#x4E9B;&#x7B7E;&#x540D;&#x7B56;&#x7565;&#x6B63;&#x662F;&#x9690;&#x5143;&#x7B56;&#x7565;&#x6307;&#x5411;&#x7684;&#x5B50;&#x7B56;&#x7565;&#x3002;</p>
<pre><code>- &amp;Org1
       # DefaultOrg defines the organization which is used in the sampleconfig
       # of the fabric.git development environment
       Name: Org1MSP

       # ID to load the MSP definition as
       ID: Org1MSP

       MSPDir: ../organizations/peerOrganizations/org1.example.com/msp

       # Policies defines the set of policies at this level of the config tree
       # For organization policies, their canonical path is usually
       #   /Channel/&lt;Application|Orderer&gt;/&lt;OrgName&gt;/&lt;PolicyName&gt;
       Policies:
           Readers:
               Type: Signature
               Rule: &quot;OR(&apos;Org1MSP.admin&apos;, &apos;Org1MSP.peer&apos;, &apos;Org1MSP.client&apos;)&quot;
           Writers:
               Type: Signature
               Rule: &quot;OR(&apos;Org1MSP.admin&apos;, &apos;Org1MSP.client&apos;)&quot;
           Admins:
               Type: Signature
               Rule: &quot;OR(&apos;Org1MSP.admin&apos;)&quot;
           Endorsement:
               Type: Signature
               Rule: &quot;OR(&apos;Org1MSP.peer&apos;)&quot;
</code></pre><p>&#x200B;    &#x4E0B;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5C55;&#x793A;&#x4E86;configtx.yaml&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x5206;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x9690;&#x5143;&#x7B56;&#x7565;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x96C6;&#x4F4D;&#x4E8E;&#x8DEF;&#x5F84;/Channel/Application/&#x4E0A;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7F3A;&#x7701;&#x7684;Fabric ACL&#x96C6;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5C06;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x9053;&#x7684;&#x8BB8;&#x591A;&#x91CD;&#x8981;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F8B;&#x5982;&#x8C01;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x901A;&#x9053;&#x8D26;&#x672C;&#x3001;&#x8C03;&#x7528;&#x94FE;&#x7801;&#x6216;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x6307;&#x5411;&#x4E86;&#x6BCF;&#x4E2A;&#x7EC4;&#x7EC7;&#x5B9A;&#x4E49;&#x7684;&#x5B50;&#x7B56;&#x7565;&#x3002;&#x4E4B;&#x524D;Org1&#x90E8;&#x5206;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5B50;&#x7B56;&#x7565;Reader, Writer, Admin&#x5C06;&#x88AB;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x5206;&#x4E2D;&#x7684;&#x9690;&#x5143;&#x7B56;&#x7565;Reader, Writer, Admin&#x8BC4;&#x4F30;&#x3002;&#x56E0;&#x4E3A;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#x662F;&#x7528;&#x9ED8;&#x8BA4;&#x7B56;&#x7565;&#x6784;&#x5EFA;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Org1&#x6765;&#x67E5;&#x8BE2;&#x901A;&#x9053;&#x5E10;&#x672C;&#x3001;&#x8C03;&#x7528;&#x94FE;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x6279;&#x51C6;&#x60A8;&#x521B;&#x5EFA;&#x7684;&#x901A;&#x9053;&#x7684;&#x901A;&#x9053;&#x66F4;&#x65B0;</p>
<pre><code>################################################################################
#
#   SECTION: Application
#
#   - This section defines the values to encode into a config transaction or
#   genesis block for application related parameters
#
################################################################################
Application: &amp;ApplicationDefaults

    # Organizations is the list of orgs which are defined as participants on
    # the application side of the network
    Organizations:

    # Policies defines the set of policies at this level of the config tree
    # For Application policies, their canonical path is
    #   /Channel/Application/&lt;PolicyName&gt;
    Policies:
        Readers:
            Type: ImplicitMeta
            Rule: &quot;ANY Readers&quot;
        Writers:
            Type: ImplicitMeta
            Rule: &quot;ANY Writers&quot;
        Admins:
            Type: ImplicitMeta
            Rule: &quot;MAJORITY Admins&quot;
        LifecycleEndorsement:
            Type: ImplicitMeta
            Rule: &quot;MAJORITY Endorsement&quot;
        Endorsement:
            Type: ImplicitMeta
            Rule: &quot;MAJORITY Endorsement&quot;
</code></pre><h2 id="fabric&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;">Fabric&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;</h2>
<p>&#x200B;    Fabric 2.0 &#x53D1;&#x5E03;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x7A0B;&#xFF0C;&#x5176;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x66F4;&#x6C11;&#x4E3B;&#x7684;&#x8FC7;&#x7A0B;&#x6765;&#x7BA1;&#x7406;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x94FE;&#x7801;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x7EC4;&#x7EC7;&#x5728;&#x94FE;&#x7801;&#x5E94;&#x7528;&#x5230;&#x901A;&#x9053;&#x4E4B;&#x524D;&#x5BF9;&#x5B83;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x3002;&#x8FD9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x7A0B;&#x548C;&#x5728;&#x8BE5;&#x8FC7;&#x7A0B;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x7B56;&#x7565;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5B83;&#x4EEC;&#x51B3;&#x5B9A;&#x4E86;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;&#x8BE5;&#x6D41;&#x7A0B;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x5728; <a href="https://hyperledger-fabric.readthedocs.io/en/release-2.3/chaincode_lifecycle.html" target="_blank">Fabric chaincode lifecycle</a>&#x8BDD;&#x9898;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x672C;&#x8BDD;&#x9898;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7406;&#x89E3;&#x7B56;&#x7565;&#x5728;&#x6D41;&#x7A0B;&#x4E2D;&#x662F;&#x5982;&#x4F55;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<p>&#x200B;    configtx.yaml&#x6587;&#x4EF6;&#x4E2D;Application&#x90E8;&#x5206;&#x5305;&#x542B;&#x4E86;&#x9ED8;&#x8BA4;&#x7684;&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x3002;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x4F60;&#x5E94;&#x8BE5;&#x4E3A;&#x4F60;&#x7684;&#x7528;&#x4F8B;&#x81EA;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x3002;</p>
<p>&#x200B;    </p>
<pre><code>################################################################################
#
#   SECTION: Application
#
#   - This section defines the values to encode into a config transaction or
#   genesis block for application related parameters
#
################################################################################
Application: &amp;ApplicationDefaults

    # Organizations is the list of orgs which are defined as participants on
    # the application side of the network
    Organizations:

    # Policies defines the set of policies at this level of the config tree
    # For Application policies, their canonical path is
    #   /Channel/Application/&lt;PolicyName&gt;
    Policies:
        Readers:
            Type: ImplicitMeta
            Rule: &quot;ANY Readers&quot;
        Writers:
            Type: ImplicitMeta
            Rule: &quot;ANY Writers&quot;
        Admins:
            Type: ImplicitMeta
            Rule: &quot;MAJORITY Admins&quot;
        LifecycleEndorsement:
            Type: ImplicitMeta
            Rule: &quot;MAJORITY Endorsement&quot;
        Endorsement:
            Type: ImplicitMeta
            Rule: &quot;MAJORITY Endorsement&quot;
</code></pre><p>&#x200B;    LifecycleEndorsement&#x7B56;&#x7565;&#x89C4;&#x5B9A;&#x4E86;&#x8C01;&#x9700;&#x8981;&#x5BF9;&#x94FE;&#x7801;&#x5B9A;&#x4E49;&#x8FDB;&#x884C;&#x6279;&#x51C6;&#x3002;</p>
<p>&#x200B;    Endorsement&#x7B56;&#x7565;&#x662F;&#x94FE;&#x7801;&#x9ED8;&#x8BA4;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x3002;&#x4E0B;&#x9762;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<h2 id="&#x94FE;&#x7801;&#x80CC;&#x4E66;&#x7B56;&#x7565;">&#x94FE;&#x7801;&#x80CC;&#x4E66;&#x7B56;&#x7565;</h2>
<p>&#x200B;    &#x5F53;&#x4F7F;&#x7528; Fabric &#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x94FE;&#x7801;&#x88AB;&#x6279;&#x51C6;&#x5E76;&#x63D0;&#x4EA4;&#x5230;&#x901A;&#x9053;&#x65F6;&#x4F1A;&#x4E3A;&#x5176;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#xFF08;&#x8FD9;&#x4E2A;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x4F1A;&#x8986;&#x76D6;&#x4E0E;&#x8BE5;&#x94FE;&#x7801;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x72B6;&#x6001;&#xFF09;&#x3002;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x901A;&#x9053;&#x914D;&#x7F6E;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x6765;&#x6307;&#x5B9A;&#xFF0C;&#x6216;&#x8005;&#x663E;&#x5F0F;&#x5730;&#x6307;&#x5B9A;&#x7B7E;&#x540D;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x5728;&#x6279;&#x51C6;&#x9636;&#x6BB5;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x6307;&#x660E;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#xFF0C;&#x5C31;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;Endorsement&#x7B56;&#x7565;&quot;MAJORITY Endorsement&quot;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x8981;&#x60F3;&#x4F7F;&#x4EA4;&#x6613;&#x751F;&#x6548;&#x5C31;&#x9700;&#x8981;&#x5927;&#x591A;&#x6570;&#x4E0D;&#x540C;&#x901A;&#x9053;&#x6210;&#x5458;&#xFF08;&#x7EC4;&#x7EC7;&#xFF09;&#x53BB;&#x6267;&#x884C;&#x5E76;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x3002;&#x9ED8;&#x8BA4;&#x7B56;&#x7565;&#x5141;&#x8BB8;&#x52A0;&#x5165;&#x901A;&#x9053;&#x7684;&#x7EC4;&#x7EC7;&#x81EA;&#x52A8;&#x52A0;&#x5165;&#x94FE;&#x7801;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7B7E;&#x540D;&#x7B56;&#x7565;&#x683C;&#x5F0F;&#x6765;&#x6307;&#x5B9A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#xFF08;&#x8FD9;&#x6837;&#x5C31;&#x9700;&#x8981;&#x94FE;&#x7801;&#x5148;&#x88AB;&#x901A;&#x9053;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x7B7E;&#x540D;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x5176;&#x4ED6;&#x7EC4;&#x7EC7;&#x7B7E;&#x540D;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x7B7E;&#x540D;&#x7B56;&#x7565;&#x8FD8;&#x5141;&#x8BB8;&#x5305;&#x542B;principals&#xFF0C;&#x5B83;&#x662F;&#x5C06;&#x6807;&#x8BC6;&#x4E0E;&#x89D2;&#x8272;&#x5339;&#x914D;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;principals&#x7C7B;&#x4F3C;&#x4E8E;&#x7528;&#x6237;ID&#x6216;&#x7EC4;ID&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x7528;&#x9014;&#x66F4;&#x4E3A;&#x5E7F;&#x6CDB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x53C2;&#x4E0E;&#x8005;&#x6807;&#x8BC6;&#x7684;&#x5404;&#x79CD;&#x5C5E;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x7EC4;&#x7EC7;&#x3001;&#x7EC4;&#x7EC7;&#x5355;&#x5143;&#x3001;&#x89D2;&#x8272;&#xFF0C;&#x751A;&#x81F3;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x7279;&#x5B9A;&#x6807;&#x8BC6;&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;principals&#x662F;&#x51B3;&#x5B9A;&#x5176;&#x6743;&#x9650;&#x7684;&#x5C5E;&#x6027;&#x3002;principals&#x7684;&#x63CF;&#x8FF0;&#x65B9;&#x5F0F;&#x662F;&apos;MSP.ROLE&apos;&#xFF0C;&#x5176;&#x4E2D;MSP&#x4EE3;&#x8868;MSP ID&#xFF08;&#x7EC4;&#x7EC7;&#xFF09;&#xFF0C;ROLE&#x4EE3;&#x8868;&#x56DB;&#x79CD;&#x89D2;&#x8272;&#x4E4B;&#x4E00;&#xFF1A;&#x6210;&#x5458;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x5BA2;&#x6237;&#xFF0C;&#x5BF9;&#x7B49;&#x8282;&#x70B9;&#xFF08;Member, Admin, Client, and Peer&#xFF09;&#x3002;&#x5F53;&#x7528;&#x6237;&#x6CE8;&#x518C;&#x5230;CA&#x65F6;&#xFF0C;&#x89D2;&#x8272;&#x5C31;&#x4F1A;&#x4E0E;&#x8EAB;&#x4EFD;&#x76F8;&#x5173;&#x8054;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;Fabric CA&#x4E0A;&#x53EF;&#x7528;&#x7684;&#x89D2;&#x8272;&#x5217;&#x8868;&#x3002;</p>
<p>&#x200B;    &#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x5408;&#x6CD5;&#x7684;principals&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<ul>
<li>&#x2018;Org0.Admin&#x2019;: Org0 MSP &#x7684;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x5458;</li>
<li>&#x2018;Org1.Member&#x2019;: Org1 MSP &#x7684;&#x4E00;&#x4E2A;&#x6210;&#x5458;</li>
<li>&#x2018;Org1.Client&#x2019;: Org1 MSP &#x7684;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;</li>
<li>&#x2018;Org1.Peer&#x2019;: Org1 MSP &#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x7B49;&#x8282;&#x70B9;</li>
<li>&#x2018;OrdererOrg.Orderer&#x2019;: OrdererOrg MSP &#x7684;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x8282;&#x70B9;</li>
</ul>
<p>&#x200B;    &#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7279;&#x5B9A;&#x7684;&#x72B6;&#x6001;(&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x7279;&#x5B9A;&#x7684;&#x952E;&#x503C;&#x5BF9;)&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x3002;&#x8FD9;&#x79CD;&#x57FA;&#x4E8E;&#x72B6;&#x6001;&#x7684;&#x80CC;&#x4E66;&#x5141;&#x8BB8;&#x7279;&#x5B9A;&#x7684;&#x952E;&#x503C;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x6765;&#x91CD;&#x8F7D;&#x9ED8;&#x8BA4;&#x7684;&#x94FE;&#x7801;&#x7EA7;&#x522B;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x200B;    &#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5199;&#x4E00;&#x4E2A;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x8BF7;&#x53C2;&#x8003;&#x8BDD;&#x9898; <a href="https://hyperledger-fabric.readthedocs.io/en/release-2.3/endorsement-policies.html" target="_blank">Endorsement policies</a>&#x3002;</p>
<p>&#x200B;    &#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x540C;&#x7248;&#x672C; Fabric &#x7684;&#x7B56;&#x7565;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A;</p>
<p>&#x200B;    &#x5728; Fabric 2.0 &#x4E4B;&#x524D;&#xFF0C;&#x94FE;&#x7801;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x5728;&#x94FE;&#x7801;&#x5B9E;&#x4F8B;&#x5316;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;&#x6307;&#x4EE4;&#x65F6;&#x66F4;&#x65B0;&#x3002;&#x5982;&#x679C;&#x5728;&#x5B9E;&#x4F8B;&#x5316;&#x65F6;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x9ED8;&#x8BA4;&#x4E3A;&#x201C;&#x901A;&#x9053;&#x4E2D;&#x7EC4;&#x7EC7;&#x7684;&#x4EFB;&#x4F55;&#x6210;&#x5458;&#x201D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5305;&#x542B;&#x7EC4;&#x7EC7;&#x201C;Org1&#x201D;&#x548C;&#x201C;Org2&#x201D;&#x7684;&#x901A;&#x9053;&#x5C06;&#x5177;&#x6709;&#x9ED8;&#x8BA4;&#x7684;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x201C;OR(&#x2018;Org1.member&#x2019;, &#x2018;Org2.member&#x2019;)&#x201D;&#x3002;</p>
<p>&#x200B;    &#x4ECE;Fabric 2.0&#x5F00;&#x59CB;&#xFF0C;Fabric&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x94FE;&#x7801;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x7A0B;&#xFF0C;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x7EC4;&#x7EC7;&#x5728;&#x94FE;&#x7801;&#x88AB;&#x5E94;&#x7528;&#x5230;&#x901A;&#x9053;&#x4E0A;&#x4E4B;&#x524D;&#x5C31;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x65B0;&#x7684;&#x8FC7;&#x7A0B;&#x8981;&#x6C42;&#x5404;&#x4E2A;&#x7EC4;&#x7EC7;&#x5BF9;&#x5B9A;&#x4E49;&#x94FE;&#x7801;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5982;&#x540D;&#x79F0;&#x3001;&#x7248;&#x672C;&#x548C;&#x94FE;&#x7801;&#x80CC;&#x4E66;&#x7B56;&#x7565;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;</p>
<h2 id="&#x91CD;&#x8F7D;&#x7B56;&#x7565;&#x5B9A;&#x4E49;">&#x91CD;&#x8F7D;&#x7B56;&#x7565;&#x5B9A;&#x4E49;</h2>
<p>&#x200B;    Hyperledger Fabric&#x5305;&#x62EC;&#x9ED8;&#x8BA4;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5BF9;&#x4E8E;&#x5165;&#x95E8;&#x3001;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x88AB;&#x81EA;&#x5B9A;&#x4E49;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;configtx.yaml&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x9ED8;&#x8BA4;&#x7B56;&#x7565;&#x3002;&#x5728;configtx.yaml&#x4E2D;&#x9664;&#x4E86;&#x9ED8;&#x8BA4;&#x7684;Readers, Writers, Admins&#x4EE5;&#x5916;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x610F;&#x7684;&#x52A8;&#x8BCD;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;</p>
<p>&#x200B;    &#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x5728;&#x521B;&#x5EFA;&#x901A;&#x9053;&#x65F6;&#x91CD;&#x8F7D;&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://hyperledger-fabric.readthedocs.io/en/release-2.3/create_channel/channel_policies.html" target="_blank">Channel policies</a> &#x548C;<a href="https://hyperledger-fabric.readthedocs.io/en/release-2.3/create_channel/create_channel_participation.html" target="_blank">Creating a channel without a system channel</a>&#x3002;</p>
<p>&#x200B;    &#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x66F4;&#x65B0;&#x901A;&#x9053;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://hyperledger-fabric.readthedocs.io/en/release-2.3/config_update.html#updating-a-channel-configuration" target="_blank">Updating a channel configuration</a>&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="membership-service-provider-msp.html" class="navigation navigation-prev " aria-label="Previous page: Membership Service Provider (MSP)">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="peers.html" class="navigation navigation-next " aria-label="Next page: Peers">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Policies","level":"2.6","depth":1,"next":{"title":"Peers","level":"2.7","depth":1,"path":"peers.md","ref":"peers.md","articles":[]},"previous":{"title":"Membership Service Provider (MSP)","level":"2.5","depth":1,"path":"membership-service-provider-msp.md","ref":"membership-service-provider-msp.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"policies.md","mtime":"2021-01-24T14:43:04.858Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-24T14:45:03.735Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

